RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_pwm.h
/*! @brief Structure for the user to configure the fault input filter. */
typedef struct _pwm_fault_input_filter_param
{
    uint8_t faultFilterCount;  /*!< Fault filter count */
    uint8_t faultFilterPeriod; /*!< Fault filter period;value of 0 will bypass the filter */
    bool faultGlitchStretch;   /*!< Fault Glitch Stretch Enable: A logic 1 means that input
                                    fault signals will be stretched to at least 2 IPBus clock cycles */
} pwm_fault_input_filter_param_t;

/*! @brief Structure is used to hold the parameters to configure a PWM fault */
typedef struct _pwm_fault_param
{
    pwm_fault_clear_t faultClearingMode;   /*!< Fault clearing mode to use */
    bool faultLevel;                       /*!< true: Logic 1 indicates fault;
                                                false: Logic 0 indicates fault */
    bool enableCombinationalPath;          /*!< true: Combinational Path from fault input is enabled;
                                                false: No combination path is available */
    pwm_fault_recovery_mode_t recoverMode; /*!< Specify when to re-enable the PWM output */
} pwm_fault_param_t;

/*!
 * @brief Structure is used to hold parameters to configure the capture capability of a signal pin
 */
typedef struct _pwm_input_capture_param
{
    bool captureInputSel;           /*!< true: Use the edge counter signal as source
                                         false: Use the raw input signal from the pin as source */
    uint8_t edgeCompareValue;       /*!< Compare value, used only if edge counter is used as source */
    pwm_input_capture_edge_t edge0; /*!< Specify which edge causes a capture for input circuitry 0 */
    pwm_input_capture_edge_t edge1; /*!< Specify which edge causes a capture for input circuitry 1 */
    bool enableOneShotCapture;      /*!< true: Use one-shot capture mode;
                                         false: Use free-running capture mode */
    uint8_t fifoWatermark;          /*!< Watermark level for capture FIFO. The capture flags in
                                         the status register will set if the word count in the FIFO
                                         is greater than this watermark level */
} pwm_input_capture_param_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialization and deinitialization
 * @{
 */

/*!
 * @brief Ungates the PWM submodule clock and configures the peripheral for basic operation.
 *
 * This API should be called at the beginning of the application using the PWM driver.
 * When user select PWMX, user must choose edge aligned output, becasue there are some limitation on center
 * aligned PWMX output.
 * When output PWMX in center aligned mode, VAL1 register controls both PWM period and PWMX duty cycle, PWMA
 * and PWMB output will be corrupted. But edge aligned PWMX output do not have such limit.
 * In master reload counter initialization mode, PWM period is depended by period of set LDOK in submodule 0
 * because this operation will reload register.
 * Submodule 0 counter initialization cannot be master sync or master reload.
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to configure
 * @param config    Pointer to user's PWM config structure.
 *
 * @return kStatus_Success means success; else failed.
 */
status_t PWM_Init(PWM_Type *base, pwm_submodule_t subModule, const pwm_config_t *config);

/*!
 * @brief Gate the PWM submodule clock
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to deinitialize
 */
void PWM_Deinit(PWM_Type *base, pwm_submodule_t subModule);

/*!
 * @brief  Fill in the PWM config struct with the default settings
 *
 * The default values are:
 * @code
 *   config->enableDebugMode = false;
 *   config->enableWait = false;
 *   config->reloadSelect = kPWM_LocalReload;
 *   config->clockSource = kPWM_BusClock;
 *   config->prescale = kPWM_Prescale_Divide_1;
 *   config->initializationControl = kPWM_Initialize_LocalSync;
 *   config->forceTrigger = kPWM_Force_Local;
 *   config->reloadFrequency = kPWM_LoadEveryOportunity;
 *   config->reloadLogic = kPWM_ReloadImmediate;
 *   config->pairOperation = kPWM_Independent;
 * @endcode
 * @param config Pointer to user's PWM config structure.
 */
void PWM_GetDefaultConfig(pwm_config_t *config);

/*! @}*/

/*!
 * @name Module PWM output
 * @{
 */
/*!
 * @brief Sets up the PWM signals for a PWM submodule.
 *
 * The function initializes the submodule according to the parameters passed in by the user. The function
 * also sets up the value compare registers to match the PWM signal requirements.
 * If the dead time insertion logic is enabled, the pulse period is reduced by the dead time period specified
 * by the user.
 * When user select PWMX, user must choose edge aligned output, becasue there are some limitation on center
 * aligned PWMX output.
 * Due to edge aligned PWMX is negative true signal, need to configure PWMX active low true level to get
 * correct duty cycle. The half cycle point will not be exactly in the middle of the PWM cycle when PWMX enabled.
 *
 * @param base        PWM peripheral base address
 * @param subModule   PWM submodule to configure
 * @param chnlParams  Array of PWM channel parameters to configure the channel(s).
 * @param numOfChnls  Number of channels to configure, this should be the size of the array passed in.
 *                    Array size should not be more than 3 as each submodule has 3 pins to output PWM.
 * @param mode        PWM operation mode, options available in enumeration ::pwm_mode_t
 * @param pwmFreq_Hz  PWM signal frequency in Hz
 * @param srcClock_Hz PWM source clock of correspond submodule in Hz. If source clock of submodule1,2,3 is from
 *                    submodule0 AUX_CLK, its source clock is submodule0 source clock divided with submodule0
 *                    prescaler value instead of submodule0 source clock.
 *
 * @return Returns kStatus_Fail if there was error setting up the signal; kStatus_Success otherwise
 */
status_t PWM_SetupPwm(PWM_Type *base,
                      pwm_submodule_t subModule,
                      const pwm_signal_param_t *chnlParams,
                      uint8_t numOfChnls,
                      pwm_mode_t mode,
                      uint32_t pwmFreq_Hz,
                      uint32_t srcClock_Hz);

/*!
 * @brief Set PWM phase shift for PWM channel running on channel PWM_A, PWM_B which with 50% duty cycle.
 *
 * @param base        PWM peripheral base address
 * @param subModule   PWM submodule to configure
 * @param pwmChannel  PWM channel to configure
 * @param pwmFreq_Hz  PWM signal frequency in Hz
 * @param srcClock_Hz PWM main counter clock in Hz.
 * @param shiftvalue  Phase shift value, range in 0 ~ 50
 * @param doSync      true: Set LDOK bit for the submodule list;
 *                    false: LDOK bit don't set, need to call PWM_SetPwmLdok to sync update.
 *
 * @return Returns kStatus_Fail if there was error setting up the signal; kStatus_Success otherwise
 */
status_t PWM_SetupPwmPhaseShift(PWM_Type *base,
                                pwm_submodule_t subModule,
                                pwm_channels_t pwmChannel,
                                uint32_t pwmFreq_Hz,
                                uint32_t srcClock_Hz,
                                uint8_t shiftvalue,
                                bool doSync);

/*!
 * @brief Updates the PWM signal's dutycycle.
 *
 * The function updates the PWM dutycyle to the new value that is passed in.
 * If the dead time insertion logic is enabled then the pulse period is reduced by the
 * dead time period specified by the user.
 *
 * @param base              PWM peripheral base address
 * @param subModule         PWM submodule to configure
 * @param pwmSignal         Signal (PWM A, PWM B, PWM X) to update
 * @param currPwmMode       The current PWM mode set during PWM setup
 * @param dutyCyclePercent  New PWM pulse width, value should be between 0 to 100
 *                          0=inactive signal(0% duty cycle)...
 *                          100=active signal (100% duty cycle)
 */
void PWM_UpdatePwmDutycycle(PWM_Type *base,
                            pwm_submodule_t subModule,
                            pwm_channels_t pwmSignal,
                            pwm_mode_t currPwmMode,
                            uint8_t dutyCyclePercent);

/*!
 * @brief Updates the PWM signal's dutycycle with 16-bit accuracy.
 *
 * The function updates the PWM dutycyle to the new value that is passed in.
 * If the dead time insertion logic is enabled then the pulse period is reduced by the
 * dead time period specified by the user.
 *
 * @param base              PWM peripheral base address
 * @param subModule         PWM submodule to configure
 * @param pwmSignal         Signal (PWM A, PWM B, PWM X) to update
 * @param currPwmMode       The current PWM mode set during PWM setup
 * @param dutyCycle         New PWM pulse width, value should be between 0 to 65535
 *                          0=inactive signal(0% duty cycle)...
 *                          65535=active signal (100% duty cycle)
 */
void PWM_UpdatePwmDutycycleHighAccuracy(
    PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmSignal, pwm_mode_t currPwmMode, uint16_t dutyCycle);

/*!
 * @brief Update the PWM signal's period and dutycycle for a PWM submodule.
 *
 * The function updates PWM signal period generated by a specific submodule according to the parameters
 * passed in by the user. This function can also set dutycycle weather you want to keep original dutycycle
 * or update new dutycycle. Call this function in local sync control mode because PWM period is depended by
 * INIT and VAL1 register of each submodule. In master sync initialization control mode, call this function
 * to update INIT and VAL1 register of all submodule because PWM period is depended by INIT and VAL1 register
 * in submodule0. If the dead time insertion logic is enabled, the pulse period is reduced by the dead time
 * period specified by the user. PWM signal will not be generated if its period is less than dead time duration.
 *
 * @param base        PWM peripheral base address
 * @param subModule   PWM submodule to configure
 * @param pwmSignal   Signal (PWM A or PWM B) to update
 * @param currPwmMode The current PWM mode set during PWM setup, options available in enumeration ::pwm_mode_t
 * @param pulseCnt    New PWM period, value should be between 0 to 65535
 *                    0=minimum PWM period...
 *                    65535=maximum PWM period
 * @param dutyCycle   New PWM pulse width of channel, value should be between 0 to 65535
 *                    0=inactive signal(0% duty cycle)...
 *                    65535=active signal (100% duty cycle)
 *                    You can keep original duty cycle or update new duty cycle
 */
void PWM_UpdatePwmPeriodAndDutycycle(PWM_Type *base,
                                         pwm_submodule_t subModule,
                                         pwm_channels_t pwmSignal,
                                         pwm_mode_t currPwmMode,
                                         uint16_t pulseCnt,
                                         uint16_t dutyCycle);

/*! @}*/

/*!
 * @brief Sets up the PWM input capture
 *
 * Each PWM submodule has 3 pins that can be configured for use as input capture pins. This function
 * sets up the capture parameters for each pin and enables the pin for input capture operation.
 *
 * @param base               PWM peripheral base address
 * @param subModule          PWM submodule to configure
 * @param pwmChannel         Channel in the submodule to setup
 * @param inputCaptureParams Parameters passed in to set up the input pin
 */
void PWM_SetupInputCapture(PWM_Type *base,
                           pwm_submodule_t subModule,
                           pwm_channels_t pwmChannel,
                           const pwm_input_capture_param_t *inputCaptureParams);

/*!
 * @brief Read the capture value.
 *
 * This function reads the capture value stored in channel's capture value register.
 * It should be called when a valid edge is detected on the input capture pin(related capture flag is set).
 * The capture circuit has two input capture registers per channel for first edge and second edge capture.
 *
 * @param base         PWM peripheral base address
 * @param subModule    PWM submodule to configure
 * @param pwmChannel   PWM channel to read from (PWM A, PWM B, or PWM X)
 * @param captureIndex Capture register to read (0 for first edge capture, 1 for second edge capture)
 *
 * @return Returns kStatus_InvalidArgument if pwmChannel does not support capture feature;
 *         kStatus_Success otherwise
 */
status_t PWM_GetInputCaptureValue(PWM_Type *base,
                                  pwm_submodule_t subModule,
                                  pwm_channels_t pwmChannel,
                                  uint8_t captureIndex,
                                  uint16_t *captureValue);

/*!
 * @brief Sets up the PWM fault channel 0 input filter.
 *
 * @param base                   PWM peripheral base address
 * @param faultInputFilterParams Parameters passed in to set up the fault input filter.
 */
void PWM_SetupFaultInputFilter(PWM_Type *base, const pwm_fault_input_filter_param_t *faultInputFilterParams);

/*!
 * @brief Sets up the PWM fault input filter.
 *
 * @param base                   PWM peripheral base address
 * @param faultChannel           PWM fault channel to configure.
 * @param faultInputFilterParams Parameters passed in to set up the fault input filter.
 */
void PWM_SetupFaultInputFilterExt(PWM_Type *base,
                                  pwm_fault_channels_t faultChannel,
                                  const pwm_fault_input_filter_param_t *faultInputFilterParams);

/*!
 * @brief Sets up the PWM fault channel 0 protection.
 *
 * @param base        PWM peripheral base address
 * @param faultNum    PWM fault to configure.
 * @param faultParams Pointer to the PWM fault config structure
 */
void PWM_SetupFaults(PWM_Type *base, pwm_fault_input_t faultNum, const pwm_fault_param_t *faultParams);

/*!
 * @brief Sets up the PWM fault protection.
 *
 * @param base         PWM peripheral base address
 * @param faultChannel PWM fault channel to configure.
 * @param faultNum     PWM fault to configure.
 * @param faultParams  Pointer to the PWM fault config structure
 */
void PWM_SetupFaultsExt(PWM_Type *base,
                        pwm_fault_channels_t faultChannel,
                        pwm_fault_input_t faultNum,
                        const pwm_fault_param_t *faultParams);

/*!
 * @brief  Fill in the PWM fault config struct with the default settings
 *
 * The default values are:
 * @code
 *   config->faultClearingMode = kPWM_Automatic;
 *   config->faultLevel = false;
 *   config->enableCombinationalPath = true;
 *   config->recoverMode = kPWM_NoRecovery;
 * @endcode
 * @param config Pointer to user's PWM fault config structure.
 */
void PWM_FaultDefaultConfig(pwm_fault_param_t *config);

/*!
 * @brief Selects the signal to output on a PWM pin when a FORCE_OUT signal is asserted.
 *
 * The user specifies which channel to configure by supplying the submodule number and whether
 * to modify PWM A or PWM B within that submodule.
 *
 * @param base       PWM peripheral base address
 * @param subModule  PWM submodule to configure
 * @param pwmChannel Channel to configure
 * @param mode       Signal to output when a FORCE_OUT is triggered
 */
void PWM_SetupForceSignal(PWM_Type *base,
                          pwm_submodule_t subModule,
                          pwm_channels_t pwmChannel,
                          pwm_force_signal_t mode);

/*!
 * @brief Enables local software force initialization on a PWM submodule.
 *
 * This function performs a software-controlled initialization, causes a FORCE_OUT
 * event which latches all double-buffered fields (DTSRCSEL, MCTRL[IPOL], SWCOUT)
 * into their active registers and, if MCTRL[LDOK] is set, also triggers a register reload.
 *
 * Call this function after updating the desired buffered registers (e.g. after
 * PWM_SetupForceSignal()) to apply the new values synchronously.
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to enable local force on
 */
static inline void PWM_EnableLocalForce(PWM_Type *base, pwm_submodule_t subModule)
{
    /* Select local FORCE signal source (FORCE_SEL = 000) */
    base->SM[subModule].CTRL2 &= MCUX_MASK_INVERT_16(PWM_CTRL2_FORCE_SEL_MASK);
    /* Enable local force (FORCE = 1): software-controlled initialization + shadow register latch */
    base->SM[subModule].CTRL2 |= PWM_CTRL2_FORCE_MASK;
}

/*!
 * @brief Updates the current polarity (MCTRL[IPOL]) for a PWM submodule.
 *
 * MCTRL[IPOL] is a double-buffered field. This function only writes the shadow register;
 * the value does NOT take effect until a FORCE_OUT event occurs. Call PWM_EnableLocalForce()
 * after this function to apply all pending changes atomically in one FORCE_OUT event.
 *
 * Only meaningful when the submodule operates in complementary mode (CTRL2[INDEP] = 0).
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to configure
 * @param polarity  kPWM_ComplementaryPwmA: PWM23 (VAL2/VAL3) drives the complementary pair
 *                  kPWM_ComplementaryPwmB: PWM45 (VAL4/VAL5) drives the complementary pair
 */
void PWM_UpdateCurrentPolarity(PWM_Type *base, pwm_submodule_t subModule, pwm_chnl_pair_operation_t polarity);

/*!
 * @name Interrupts Interface
 * @{
 */

/*!
 * @brief Enables the selected PWM interrupts
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to configure
 * @param mask      The interrupts to enable. This is a logical OR of members of the
 *                  enumeration ::pwm_interrupt_enable_t
 */
static inline void PWM_EnableInterrupts(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
    /* Upper 16 bits are for related to the submodule */
    base->SM[subModule].INTEN |= (uint16_t)(mask & 0xFFFFUL);
    /* Fault related interrupts */
#if defined(FSL_FEATURE_PWM_FAULT_CH_COUNT) && (FSL_FEATURE_PWM_FAULT_CH_COUNT > 1)
    base->FAULT[0].FCTRL |= ((uint16_t)(mask >> 16U) & PWM_FCTRL_FIE_MASK);
    base->FAULT[1].FCTRL |= ((uint16_t)(mask >> 20U) & PWM_FCTRL_FIE_MASK);
#else
    base->FCTRL |= ((uint16_t)(mask >> 16U) & PWM_FCTRL_FIE_MASK);
#endif
}

/*!
 * @brief Disables the selected PWM interrupts
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to configure
 * @param mask      The interrupts to enable. This is a logical OR of members of the
 *                  enumeration ::pwm_interrupt_enable_t
 */
static inline void PWM_DisableInterrupts(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
    base->SM[subModule].INTEN &= MCUX_MASK_INVERT_16(mask & 0xFFFFUL);
#if defined(FSL_FEATURE_PWM_FAULT_CH_COUNT) && (FSL_FEATURE_PWM_FAULT_CH_COUNT > 1)
    base->FAULT[0].FCTRL &= MCUX_MASK_INVERT_16((uint16_t)(mask >> 16U) & PWM_FCTRL_FIE_MASK);
    base->FAULT[1].FCTRL &= MCUX_MASK_INVERT_16((uint16_t)(mask >> 20U) & PWM_FCTRL_FIE_MASK);
#else
    base->FCTRL &= MCUX_MASK_INVERT_16((uint16_t)(mask >> 16U) & PWM_FCTRL_FIE_MASK);
#endif
}

/*!
 * @brief Gets the enabled PWM interrupts
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to configure
 *
 * @return The enabled interrupts. This is the logical OR of members of the
 *         enumeration ::pwm_interrupt_enable_t
 */
static inline uint32_t PWM_GetEnabledInterrupts(PWM_Type *base, pwm_submodule_t subModule)
{
    uint32_t enabledInterrupts;

    enabledInterrupts = base->SM[subModule].INTEN;
#if defined(FSL_FEATURE_PWM_FAULT_CH_COUNT) && (FSL_FEATURE_PWM_FAULT_CH_COUNT > 1)
    enabledInterrupts |= (((uint32_t)base->FAULT[0].FCTRL & PWM_FCTRL_FIE_MASK) << 16UL);
    enabledInterrupts |= (((uint32_t)base->FAULT[1].FCTRL & PWM_FCTRL_FIE_MASK) << 20UL);
#else
    enabledInterrupts |= (((uint32_t)base->FCTRL & PWM_FCTRL_FIE_MASK) << 16UL);
#endif
    return enabledInterrupts;
}

/*! @}*/

/*!
 * @name DMA Interface
 * @{
 */

/*!
 * @brief Capture DMA Enable Source Select.
 *
 * @param base                  PWM peripheral base address
 * @param subModule             PWM submodule to configure
 * @param pwm_watermark_control PWM FIFO watermark and control
 */
static inline void PWM_DMAFIFOWatermarkControl(PWM_Type *base,
                                               pwm_submodule_t subModule,
                                               pwm_watermark_control_t pwm_watermark_control)
{
    uint16_t reg = base->SM[subModule].DMAEN;
    if (pwm_watermark_control == kPWM_FIFOWatermarksOR)
    {
        MCUX_REG_BIT_CLEAR16(reg, PWM_DMAEN_FAND_MASK);
    }
    else
    {
        MCUX_REG_BIT_SET16(reg, PWM_DMAEN_FAND_MASK);
    }
    base->SM[subModule].DMAEN = reg;
}

/*!
 * @brief Capture DMA Enable Source Select.
 *
 * @param base                  PWM peripheral base address
 * @param subModule             PWM submodule to configure
 * @param pwm_dma_source_select PWM capture DMA enable source select
 */
static inline void PWM_DMACaptureSourceSelect(PWM_Type *base,
                                              pwm_submodule_t subModule,
                                              pwm_dma_source_select_t pwm_dma_source_select)
{
    uint16_t reg = base->SM[subModule].DMAEN;

    MCUX_REG_BIT_CLEAR16(reg, PWM_DMAEN_CAPTDE_MASK);

    reg |= (((uint16_t)pwm_dma_source_select << (uint16_t)PWM_DMAEN_CAPTDE_SHIFT) & (uint16_t)PWM_DMAEN_CAPTDE_MASK);

    base->SM[subModule].DMAEN = reg;
}

/*!
 * @brief Enables or disables the selected PWM DMA Capture read request.
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to configure
 * @param mask      The DMA to enable or disable. This is a logical OR of members of the
 *                  enumeration ::pwm_dma_enable_t
 * @param activate  true: Enable DMA read request; false: Disable DMA read request
 */
static inline void PWM_EnableDMACapture(PWM_Type *base, pwm_submodule_t subModule, uint16_t mask, bool activate)
{
    uint16_t reg = base->SM[subModule].DMAEN;
    if (activate)
    {
        MCUX_REG_BIT_SET16(reg, mask);
    }
    else
    {
        MCUX_REG_BIT_CLEAR16(reg, mask);
    }
    base->SM[subModule].DMAEN = reg;
}

/*!
 * @brief Enables or disables the PWM DMA write request.
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to configure
 * @param activate  true: Enable DMA write request; false: Disable DMA write request
 */
static inline void PWM_EnableDMAWrite(PWM_Type *base, pwm_submodule_t subModule, bool activate)
{
    uint16_t reg = base->SM[subModule].DMAEN;
    if (activate)
    {
        MCUX_REG_BIT_SET16(reg, PWM_DMAEN_VALDE_MASK);
    }
    else
    {
        MCUX_REG_BIT_CLEAR16(reg, PWM_DMAEN_VALDE_MASK);
    }
    base->SM[subModule].DMAEN = reg;
}

/*! @}*/

/*!
 * @name Status Interface
 * @{
 */

/*!
 * @brief Gets the PWM status flags
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to configure
 *
 * @return The status flags. This is the logical OR of members of the
 *         enumeration ::pwm_status_flags_t
 */
static inline uint32_t PWM_GetStatusFlags(PWM_Type *base, pwm_submodule_t subModule)
{
    uint32_t statusFlags;

