RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_pwm.h
    statusFlags = base->SM[subModule].STS;
#if defined(FSL_FEATURE_PWM_FAULT_CH_COUNT) && (FSL_FEATURE_PWM_FAULT_CH_COUNT > 1)
    statusFlags |= (((uint32_t)base->FAULT[0].FSTS & PWM_FSTS_FFLAG_MASK) << 16UL);
    statusFlags |= (((uint32_t)base->FAULT[1].FSTS & PWM_FSTS_FFLAG_MASK) << 20UL);
#else
    statusFlags |= (((uint32_t)base->FSTS & PWM_FSTS_FFLAG_MASK) << 16UL);
#endif

    return statusFlags;
}

/*!
 * @brief Clears the PWM status flags
 *
 * @param base      PWM peripheral base address
 * @param subModule PWM submodule to configure
 * @param mask      The status flags to clear. This is a logical OR of members of the
 *                  enumeration ::pwm_status_flags_t
 */
#if defined(FSL_FEATURE_PWM_FAULT_CH_COUNT) && (FSL_FEATURE_PWM_FAULT_CH_COUNT > 1)
static inline void PWM_ClearStatusFlags(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
    uint16_t reg;

    base->SM[subModule].STS = (uint16_t)(mask & 0xFFFFUL);

    reg = base->FAULT[0].FSTS;
    MCUX_REG_BIT_CLEAR16(reg, PWM_FSTS_FFLAG_MASK);
    reg |= (uint16_t)((mask >> 16U) & PWM_FSTS_FFLAG_MASK);
    base->FAULT[0].FSTS = reg;

    reg = base->FAULT[1].FSTS;
    MCUX_REG_BIT_CLEAR16(reg, PWM_FSTS_FFLAG_MASK);
    reg |= (uint16_t)((mask >> 20U) & PWM_FSTS_FFLAG_MASK);
    base->FAULT[1].FSTS = reg;
}
#else
static inline void PWM_ClearStatusFlags(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
    uint16_t reg;

    base->SM[subModule].STS = (uint16_t)(mask & 0xFFFFUL);
    reg                     = base->FSTS;
    /* Clear the fault flags and set only the ones we wish to clear as the fault flags are cleared
     * by writing a login one
     */
    MCUX_REG_BIT_CLEAR16(reg, PWM_FSTS_FFLAG_MASK);
    reg |= (uint16_t)((mask >> 16U) & PWM_FSTS_FFLAG_MASK);
    base->FSTS = reg;
}
#endif

/*! @}*/

/*!
 * @name Timer Start and Stop
 * @{
 */

/*!
 * @brief Starts the PWM counter for a single or multiple submodules.
 *
 * Sets the Run bit which enables the clocks to the PWM submodule. This function can start multiple
 * submodules at the same time.
 *
 * @param base              PWM peripheral base address
 * @param subModulesToStart PWM submodules to start. This is a logical OR of members of the
 *                          enumeration ::pwm_module_control_t
 */
static inline void PWM_StartTimer(PWM_Type *base, uint8_t subModulesToStart)
{
    base->MCTRL |= PWM_MCTRL_RUN(subModulesToStart);
}

/*!
 * @brief Stops the PWM counter for a single or multiple submodules.
 *
 * Clears the Run bit which resets the submodule's counter. This function can stop multiple
 * submodules at the same time.
 *
 * @param base             PWM peripheral base address
 * @param subModulesToStop PWM submodules to stop. This is a logical OR of members of the
 *                         enumeration ::pwm_module_control_t
 */
static inline void PWM_StopTimer(PWM_Type *base, uint8_t subModulesToStop)
{
    MCUX_REG_BIT_CLEAR16(base->MCTRL, PWM_MCTRL_RUN(subModulesToStop));
}

/*! @}*/

/*!
 * @brief Set the PWM VALx registers.
 *
 * This function allows the user to write value into VAL registers directly. And it will destroying the PWM clock period
 * set by the PWM_SetupPwm()/PWM_SetupPwmPhaseShift() functions.
 * Due to VALx registers are bufferd, the new value will not active uless call PWM_SetPwmLdok() and the reload point is
 * reached.
 *
 * @param base          PWM peripheral base address
 * @param subModule     PWM submodule to configure
 * @param valueRegister VALx register that will be writen new value
 * @param value         Value that will been write into VALx register
 */
static inline void PWM_SetVALxValue(PWM_Type *base,
                                    pwm_submodule_t subModule,
                                    pwm_value_register_t valueRegister,
                                    uint16_t value)
{
    switch (valueRegister)
    {
        case kPWM_ValueRegister_0:
            base->SM[subModule].VAL0 = value;
            break;
        case kPWM_ValueRegister_1:
            base->SM[subModule].VAL1 = value;
            break;
        case kPWM_ValueRegister_2:
            base->SM[subModule].VAL2 = value;
            break;
        case kPWM_ValueRegister_3:
            base->SM[subModule].VAL3 = value;
            break;
        case kPWM_ValueRegister_4:
            base->SM[subModule].VAL4 = value;
            break;
        case kPWM_ValueRegister_5:
            base->SM[subModule].VAL5 = value;
            break;
        default:
            assert(false);
            break;
    }
}

/*!
 * @brief Get the PWM VALx registers.
 *
 * @param base          PWM peripheral base address
 * @param subModule     PWM submodule to configure
 * @param valueRegister VALx register that will be read value
 * @return The VALx register value
 */
static inline uint16_t PWM_GetVALxValue(PWM_Type *base, pwm_submodule_t subModule, pwm_value_register_t valueRegister)
{
    uint16_t temp = 0U;

    switch (valueRegister)
    {
        case kPWM_ValueRegister_0:
            temp = base->SM[subModule].VAL0;
            break;
        case kPWM_ValueRegister_1:
            temp = base->SM[subModule].VAL1;
            break;
        case kPWM_ValueRegister_2:
            temp = base->SM[subModule].VAL2;
            break;
        case kPWM_ValueRegister_3:
            temp = base->SM[subModule].VAL3;
            break;
        case kPWM_ValueRegister_4:
            temp = base->SM[subModule].VAL4;
            break;
        case kPWM_ValueRegister_5:
            temp = base->SM[subModule].VAL5;
            break;
        default:
            assert(false);
            break;
    }

    return temp;
}

/*!
 * @brief Enables or disables the PWM output trigger.
 *
 * This function allows the user to enable or disable the PWM trigger. The PWM has 2 triggers. Trigger 0
 * is activated when the counter matches VAL 0, VAL 2, or VAL 4 register. Trigger 1 is activated
 * when the counter matches VAL 1, VAL 3, or VAL 5 register.
 *
 * @param base          PWM peripheral base address
 * @param subModule     PWM submodule to configure
 * @param valueRegister Value register that will activate the trigger
 * @param activate      true: Enable the trigger; false: Disable the trigger
 */
static inline void PWM_OutputTriggerEnable(PWM_Type *base,
                                           pwm_submodule_t subModule,
                                           pwm_value_register_t valueRegister,
                                           bool activate)
{
    assert((uint16_t)valueRegister <= 5U);

    if (activate)
    {
        base->SM[subModule].TCTRL |= ((uint16_t)1U << (uint16_t)valueRegister);
    }
    else
    {
        base->SM[subModule].TCTRL &= ~((uint16_t)1U << (uint16_t)valueRegister);
    }
}

/*!
 * @brief Enables the PWM output trigger.
 *
 * This function allows the user to enable one or more (VAL0-5) PWM trigger.
 *
 * @param base              PWM peripheral base address
 * @param subModule         PWM submodule to configure
 * @param valueRegisterMask Value register mask that will activate one or more (VAL0-5) trigger
 *                          enumeration ::_pwm_value_register_mask
 */
static inline void PWM_ActivateOutputTrigger(PWM_Type *base, pwm_submodule_t subModule, uint16_t valueRegisterMask)
{
    base->SM[subModule].TCTRL |= (PWM_TCTRL_OUT_TRIG_EN_MASK & (valueRegisterMask));
}

/*!
 * @brief Disables the PWM output trigger.
 *
 * This function allows the user to disables one or more (VAL0-5) PWM trigger.
 *
 * @param base              PWM peripheral base address
 * @param subModule         PWM submodule to configure
 * @param valueRegisterMask Value register mask that will Deactivate one or more (VAL0-5) trigger
 *                          enumeration ::_pwm_value_register_mask
 */
static inline void PWM_DeactivateOutputTrigger(PWM_Type *base, pwm_submodule_t subModule, uint16_t valueRegisterMask)
{
    base->SM[subModule].TCTRL &= MCUX_MASK_INVERT_16(PWM_TCTRL_OUT_TRIG_EN_MASK & (valueRegisterMask));
}

/*!
 * @brief Sets the software control output for a pin to high or low.
 *
 * The user specifies which channel to modify by supplying the submodule number and whether
 * to modify PWM A or PWM B within that submodule.
 *
 * @param base       PWM peripheral base address
 * @param subModule  PWM submodule to configure
 * @param pwmChannel Channel to configure
 * @param value      true: Supply a logic 1, false: Supply a logic 0.
 */
static inline void PWM_SetupSwCtrlOut(PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmChannel, bool value)
{
    assert(pwmChannel != kPWM_PwmX);
    uint32_t swcout = (((uint32_t)subModule * PWM_SUBMODULE_SWCONTROL_WIDTH) + (uint32_t)pwmChannel);
    assert(swcout <= 7U);

